{"url": "https://es.wikipedia.org/wiki/Pedag%C3%B3gico", "title": "Pedagogía", "summary": "La pedagogía es una ciencia social e interdisciplinaria enfocada en la investigación y reflexión de las teorías educativas en todas las etapas de la vida, no solo en la infancia.[1]​[2]​[3]​[4]​[5]​[6]​ Esta ciencia se nutre de conocimientos provenientes de la sociología, historia, antropología, filosofía, psicología y política.[1]​[2]​[3]​[4]​[5]​ El término \"pedagogía\" ha evolucionado para referirse a una ciencia dedicada al estudio de la educación como un fenómeno complejo y multirreferencial.\n\nEl propósito del pedagogo es el construir teoría referente a la investigación educativa.[7]​ La educación por su parte, es un proceso permanente e inacabado a lo largo de toda la vida, que busca la formación integral del ser humano; se refiere a la acción de formar y perfeccionar, es decir, una acción práctica que se da en todas las sociedades. \n\nEl objeto de estudio en la pedagogía es «la educación»[8]​, en sentido amplio, y ha cobrado un estatuto institucional y legal desde las diversas legislaciones internacionales, como refieren los documentos de la Organización de las Naciones Unidas para la Educación la Ciencia y la Cultura (Unesco), o la Organización de Estados Iberoamericanos para la Educación, la Ciencia y la Cultura (OEI), a su vez que los propios de cada país (como las leyes generales o nacionales sobre educación). También es posible encontrar la palabra «formación» como objeto de estudio de la pedagogía, siendo «educación» y «formación» vocablos en debate, pues indican términos y posiciones epistemológicas diferentes referidas a lo educativo.  \n\nLa pedagogía, como ciencia enfocada al estudio del fenómeno educativo, cuenta con diversas áreas laborales y de aplicación como son: el currículum, las nuevas tecnologías aplicadas a la educación, la docencia, la investigación educativa, la gestión administrativa o directiva enfocada a la educación, la orientación educativa, el desarrollo comunitario entre otras.[9]​\n\n", "sections": [{"name": "Paradigmas de la pedagogía", "text": "El paradigma de la pedagogía (o paradigma de la educación) es el modelo bajo el cual se educa; es decir, es el conjunto de concepciónes filosoficas sobre la educación que vienen a influir en la praxis y finalidad de los procesos pedagógicos educacionales.\n\nExisten muchos paradigmas de la educación, tales como:\n\n", "subsections": [{"name": "Pedagogía crítica", "text": "La pedagogía crítica es una corriente pedagógica,  una filosofía de la educación y un movimiento social que desarrolló y aplicó conceptos provenientes de  la Teoría Crítica de la Escuela de Fráncfort y tradiciones relacionadas, hacia el campo de la educación y el estudio de la cultura.[10]​ \n\nLa Pedagogía Crítica, al contrario que la \"Educación bancaria\", rechaza la idea de que el conocimiento es políticamente neutral y argumenta que la enseñanza es un acto inherentemente político, ya sea que el maestro lo reconozca o no. Por lo tanto, las cuestiones de justicia social y democracia no son distintas de los actos de enseñanza y aprendizaje.[11]​ El objetivo de la pedagogía crítica es la emancipación de la opresión a través del despertar de la conciencia crítica, basada en el término portugués conscientização. Cuando se logra, la conciencia crítica alienta a los individuos a efectuar el cambio en su mundo a través de la crítica social y la acción política.\n\n"}, {"name": "Pedagogía Progresista o Escuela Nueva", "text": "La pedagogía progresista, también conocida como educación progresista y con otras muy diversas denominaciones (entre ellas, escuela nueva, escuela activa, nueva educación, educación nueva),[15]​ es un movimiento o un grupo de movimientos pedagógicos de carácter progresista, críticos con la educación tradicional, a la que acusan de formalismo, de autoritarismo, de fomentar la competitividad, y de constituir una mera transmisión de conocimientos mediante la memorización, pasiva para el alumno y ajena a sus intereses, definiendo su modelo con los rasgos opuestos: educación práctica, vital,[16]​ participativa, democrática, colaborativa, activa y motivadora.[17]​ \n\nEstos movimientos surgieron a finales del siglo XIX, continuaron su desarrollo en el siglo siguiente, y se volvieron predominantes en las denominadas reformas educativas planteadas en el contexto intelectual de la revolución de 1968. También se utilizan expresiones como pedagogía reformista o educación reformista, denominaciones que no solo se vinculan a las legislaciones de reforma educativa, sino a los proyectos de reforma social (la propia utilización de la palabra reforma implica una connotación progresista, hasta tal punto que las modificaciones educativas con carácter conservador se suelen calificar de \"contra-reformas\" por los partidarios de la pedagogía progresista).[18]​ \n\n"}, {"name": "Pedagogía Anarquista", "text": "La pedagogía en el anarquismo se refiere a una serie de planteamientos propuestos sobre pedagogía hecha por determinados sectores del anarquismo. Representa usualmente la parte educacional del mismo (partidaria de un cambio político y social evolucionario, que desembocaría en un cambio revolucionario). Los puntos en común de estas propuestas se relacionan con conseguir un método de aprendizaje en el que la persona pueda desarrollar sus aptitudes libremente, sin autoridad impuesta. Para un pedagogo como Sébastien Faure, «los niños no pertenecen ni a Dios, ni al Estado, ni a su familia, solo a ellos mismos». \n\nFamosos pedagogos y escritores tales como Francisco Ferrer Guardia, Ricardo Mella y León Tolstói escribieron sobre este tema, poniendo en práctica diversas experiencias escolares como la Escuela Moderna de Barcelona a comienzos del siglo XX, La Ruche promovida por Sébastien Faure, la escuela racionalista de José Sánchez Rosa en Andalucía, o las escuelas para obreros de los ateneos populares anarcosindicalistas en la España del primer tercio del siglo XX (llamados ateneos libertarios). En los Estados Unidos surgió entre 1910 y 1960 un movimiento de escuelas modernas inspirado en la obra de Ferrer. \n\nPensadores de la corriente humanista (Emmanuel Mounier, Bertrand Russell), del campo de la psicología (Erich Fromm) y de la pedagogía (Célestin Freinet, Ivan Illich o Rudolf Steiner) han retroalimentado las ideas de una pedagogía de corte anarquista. Más recientemente, pensadores de variadas formas de anarquismo han planteado reformas educativas en torno a conceptos tan distintos como la desescolarización de Iván Illich, la pedagogía Waldorf de Rudolf Steiner, la Pedagogía Activa No Directiva o la educación en el hogar promovida por asociaciones de padres de familia.\n\n"}, {"name": "Pedagogía Cibernética", "text": "La pedagogía cibernética consiste en el control de los procesos cognitivos de los estudiantes durante su proceso de instrucción. Esta se apoya en teoría de la cibernética, y en algunas ideas y conceptos surgidas de la matemática, conocidas como Algoritmo y Heurística, y que coadyuva en la solución de problemas y la creatividad.[22]​\n\nEl Algoritmo, desde el punto de vista de la Cibernética, son los estados estables del proceso de auto organización del cerebro, y la Heurística sería un estado nuevo alcanzado por realimentación positiva. Es un tipo de metacognición, con el que sea analiza el propio pensamiento para alcanzar un nuevo y mejor estado de comprensión, y para la solución de problemas. \n\nEn la Pedagogía Cibernética, el control no es rígido y unidireccional del profesor al estudiante, ya que este último tiene un papel activo a partir de sus propias experiencias y elecciones. Hay una especie de autodidactismo en que debe haber un espacio para la creación mental. Esto porque esta pedagogía se basa en la teoría de la cibernética: el estudio del flujo de información y que regula un sistema en una cierta dirección, que en nuestro caso es entre el alumno y el profesor (pero que también en la dirección inversa, estudiando las respuestas del alumno, y aprendiendo de él), para el control del aprendizaje.\n\nIntenta ser un método eficiente en trasmitir el conocimiento, regulando el aprendizaje por medio de algoritmos, y buscando que sea el mismo alumno quien termine controlando este proceso. El profesor solo intenta organizar las condiciones externas para que el alumno aprenda participando activamente del proceso de aprendizaje. El objetivo final es que sea el propio alumno el que finalmente controle su propio aprendizaje: que aprenda a pensar, y a aprender por el mismo. Cuanto más rápido sea alcanzado este objetivo, es mejor.[23]​\n\nPero el objetivo no solo es transmitir conocimiento, sino que también “actitudes, responsabilidad, bondad”…“hábitos rigurosos para el desarrollo especifico de todo tipo de actividades (lectura, escritura, cálculos aritméticos, la solución de varios tipos de problemas prácticos e intelectuales).”[22]​\n\nEsta pedagogía no sustituye a la Pedagogía tradicional, pero la hace posible,[22]​ ya que es tener el conocimiento de algo, no implica su correcta aplicación, como acontece con cualquier área del conocimiento (mismo en la Pedagogía). \nÈsta ya ha mostrado su eficacia en diversa áreas educativas como en geometría, gramática, ortografía de su idioma en Rusia, y los resultados que obtuvieron fueron muy alentadores, según sus propias palabras:[22]​\n\n"}, {"name": "Pedagogía de la Liberación", "text": "La pedagogía de la liberación es un movimiento educativo. La educación liberadora es un proceso de renovación de la condición social del individuo, considerando al sujeto como un ser pensante y crítico, reflexivo de la realidad que vive. En este proceso, la liberación se contrapone a la pedagogía bancaria, la cual limita la posibilidad de creación de conocimientos propios, fomentando la reproducción sin análisis ni comprensión de los temas que se estén enseñando.[25]​\n"}]}, {"name": "Historia", "text": "Para una mejor comprensión de la historia de la conformación de la pedagogía y su relación con la educación,[27]​ Immanuel Kant, Durkheim y el idealismo alemán aportan una serie de elementos importantes. Por un lado, Kant propone la confección de una disciplina que sea científica, teórica y práctica, que se base en principios, experimentación y reflexiones sobre prácticas concretas.[28]​  En cambio, Durkheim, quien inauguró en la Sorbonne, Francia, en 1902, el primer curso sobre “La ciencia de la educación”,[29]​ al referirse a esta, expresa que es materia de la pedagogía y es indispensable construir un saber por medio de la implementación de reglas metodológicas −postura positivista− que sea garante del carácter científico de dicho conocimiento.[30]​ Mientras que Hegel y el idealismo alemán confieren a la pedagogía un estatus más trascendental, capaz de darle sentido a la existencia humana, siendo los antecedentes de la pedagogía trascendente e idealista.\n\nLa pedagogía no consiste solo en cumplir el rol de docente, sino que también se dedica al aprendizaje y entender de qué manera se produce.\n\n", "subsections": []}, {"name": "Etimología", "text": "Pedagogía (del griego clásico παιδίον [paidíon] ‘niño’ y ἀɣωɣός [agōgós] ‘guía, conductor’). [31]​ La palabra proviene del griego παιδαɣωɣέω (paidagōgeō); en el cual παῖς (gen. παιδός paidós) significa “niño” y ἄɣω (ágō) significa “guía”, o sea “dirigir al niño”. En la antigua Grecia el pedagogo era el esclavo encargado de acompañar al niño hasta la palestra o “didaskaleía”:[32]​  \n\nDe la palabra griega παιδαɣωɣέω, luego latinizada como paedagogus, posteriormente surge la actual palabra castellana pedante con el significado de aquel con algunos pocos o fementidos conocimientos, que suele charlatanear o ser intelectualoide (es decir, alguien o algo que aparenta ser intelectual) y que suele fascinar a los ignaros y a las personas pueriles (por ejemplo, pasar por “sapiente” ante las personas cuya mentalidad es de παιδός [paidós] o pueriles), por tal motivo es importante distinguir la palabra pedagogo de su derivada peyorativamente pedante.\n\n", "subsections": []}, {"name": "Definición en diccionarios no especializados", "text": "Tanto el Diccionario de la lengua española de la Real Academia Española,[33]​ como el Diccionario Salamanca de la lengua española,[34]​ definen la pedagogía como la ciencia que se ocupa de la educación y la enseñanza. [35]​ Tiene como objetivo proporcionar guías para planificar, ejecutar y evaluar procesos de enseñanza y aprendizaje,[36]​ aprovechando las aportaciones e influencias de diversas ciencias, como la psicología (del desarrollo, personalidad, superdotación, educativa, social), la sociología, la antropología, la filosofía, la historia y la medicina, entre otras. Por lo tanto, el pedagogo es el profesional que ayuda a organizar mejores sistemas y programas educativos,[37]​ con el objeto de favorecer al máximo el desarrollo de las personas y las sociedades. Estudia la educación en todas sus vertientes: escolar, familiar, laboral, social y cultural.[38]​\n\nEn resumen, podría decirse que la pedagogía es la ciencia cuyo objeto de estudio es la formación de la personalidad de la persona. Las tendencias actuales pretenden que esta educación sea integral, es decir, en todas las dimensiones de la persona. La formación es el proceso de preparación de la persona para la vida. Por eso algunos autores consideran que la formación y la educación son sinónimos.\n\n", "subsections": []}, {"name": "Véase también", "text": "Ciencias de la educación\nDiseño instruccional\nMateriales didácticos\nPaulo Freire\nEducación\nDidáctica\nFilosofía de la educación\nPedagogía Waldorf\nMétodo Montessori\nMétodo Decroly\nAndragogía\nJuan Bosco\nCiencias de la educación\nDiseño instruccional\nMateriales didácticos\nPaulo Freire\nEducación\nDidáctica\nFilosofía de la educación\nPedagogía Waldorf\nMétodo Montessori\nMétodo Decroly\nAndragogía\nJuan Bosco\n", "subsections": []}, {"name": "Referencias", "text": "↑ a b Torrano, Conrad. (2015). Pensamiento pedagógico en el idealismo alemán y en Schleiermacher, por José María Quintana Cabanas. Historia y Memoria de la Educación. 1. 497. 10.5944/hme.1.2015.13206. \n\n↑ a b «Pedagogy definition and meaning | Collins English Dictionary». www.collinsdictionary.com (en inglés). Consultado el 9 de abril de 2020. \n\n↑ a b «Definition of PEDAGOGY». www.merriam-webster.com (en inglés). Consultado el 9 de abril de 2020. \n\n↑ a b Petrie, Pat; Boddy, Janet; Cameron, Claire; Heptinstall, Ellen; McQuail, Susan; Simon, Antonia; Wigfall, Valerie (2009-04). Pedagogy - a holistic, personal approach to work with children and young people, across services: European models for practice, training, education and qualification. Unpublished briefing paper. Consultado el 6 de octubre de 2021. \n\n↑ a b «Pedagogía». oferta.unam.mx. Consultado el 9 de abril de 2020. \n\n↑ Larroyo, Francisco (1982). Diccionario Porrúa de pedagogía y ciencias de la educación. Editorial Porrúa. OCLC 949330786. Consultado el 14 de octubre de 2021. \n\n↑ Liscano, Alirio (8 de septiembre de 2010). «La pedagogía como ciencia de la educación». Archipiélago. Revista cultural de nuestra América 14 (56). Consultado el 9 de abril de 2020. \n\n↑ «¿Necesitas saber cuál es el objetivo de la Pedagogía?». \n\n↑ «La transición en la pedagogía como campo de conocimiento. Una mirada desde el análisis conceptual de la producción discursiva». \n\n↑ Kincheloe, J. L., & Steinberg, S. R. (1997). Changing multiculturalism. Open University.\n\n↑ Giroux, H. (2007). Utopian thinking in dangerous times: Critical pedagogy and the project of educated hope. Utopian pedagogy: Radical experiments against neoliberal globalization, 25-42.\n\n↑ «Paulo Freire. Pedagogo de los oprimidos y transmisor de la pedagogía de la esperanza.». \n\n↑ Saviani, Dermeval (1 de enero de 1984). «LAS TEORIAS DE LA EDUCACION Y EL PROBLEMA DE LA MARGINALIDAD EN AMERICA LATINA». Revista Colombiana de Educación (13). ISSN 2323-0134. doi:10.17227/01203916.5099. Consultado el 16 de marzo de 2020. \n\n↑ http://www.ibe.unesco.org/es/la-oie-en-breve.html\n\n↑ Escuela Nueva (documento pdf), sitio digital '[www.uhu.es Universidad de Huelva]',\n\n↑ Manuel García Morente, La periodicidad en el curso de la vida, en Obras Completas, Anthropos Editorial, 1996, ISBN 84-7658-498-9, pg. 208-209: «La educación puede concebirse según dos distintas finalidades: una (...) formalista y otra (...) vital (...) La educación formalista se propone única, exclusivamente, la realización de los valores. Para ella, la vida del hombre -y del niño- debe plegarse, doblegarse, acomodarse a las formas ideales que la razón diseña. (...) Aspira a hacer hombres justos, buenos ciudadanos, hombres religiosos; pero no por los hombres, sino por la justicia, la ciudadanía y la religión. (...) La educación verdaderamente tal, puesto que es una actividad práctica y vital, se orienta hacia la realidad de las almas jóvenes, no para que luzcan los valores, sino para que por los valores luzca y brille el hombre mismo. (...) El pedagogo debe servir a los intereses del Niño, de cada niño.»\n\n↑ Mayra Elena Salas, DEL PROCESO DE ENSEÑANZA APRENDIZAJE TRADICIONAL, AL PROCESO DE ENSEÑANZA APRENDIZAJE PARA LA FORMACIÓN DE COMPETENCIAS, EN LOS ESTUDIANTES DE LA ENSEÑANZA BÁSICA, MEDIA SUPERIOR Y SUPERIOR, en Cuadernos de Educación y Desarrollo, vol. 1, nº 7, septiembre de 2009.\n\n↑ Isabel Celaá, La contra-reforma educativa, El País, 28 de agosto de 2012\n\n↑ En cada caso, el tipo de alumno a integrar es diferente: en Estados Unidos, durante la lucha por los derechos civiles, fue la integración de los negros; en España, la de los gitanos; en otros contextos, la de los inmigrantes; genéricamente, la de alumnos designados -según la cambiante terminología considerada menos ofensiva en cada momento en el lenguaje políticamente correcto- como minusválidos, handicapped, discapacitados, \"con diferentes capacidades\" o \"alumnos con necesidades educativas especiales\" -ACNEE-.\nNestor Carasa, http://www.educacionenvalores.org/spip.php?article1022 Integración escolar\n\nNestor Carasa, http://www.educacionenvalores.org/spip.php?article1022 Integración escolar\nNestor Carasa, http://www.educacionenvalores.org/spip.php?article1022 Integración escolar\n↑ CVC. Educational Research Associates, fuente citada en en:Individualized teaching\n\n↑ Puiggrós (2012). «2». Pedagogia. Universidad Nacional de Quilmes. \n\n↑ a b c d  Landa, L. N. (1977),“Cibernética y aprendizaje: pedagogía cibernética”, Buenos Aires: Editorial Paidós, \n\n↑  Landa, L. N. (1994) “Algoritmization in Learnig and Instruction” Englewood Cliff, New Jersey: Educational Technology Publications \n\n↑ López Sandoval, E. «“La creatividad en la Solución de Problemas: con aplicación a la Física y la Matemática”». \n\n↑ «La Educación Liberadora de Paulo Freire». \n\n↑ «PAULO FREIRE Y LA PEDAGOGÕA DEL OPRIMIDO». \n\n↑ «¿Qué hace la Pedagogía y por qué es importante para los educadores?». \n\n↑ Herrera, Martha Cecilia (1 de enero de 1993). «Elementos generales sobre la historia de la educación y la pedagogía». Pedagogía y Saberes (4). ISSN 2500-6436. doi:10.17227/01212494.4pys49.54. Consultado el 24 de octubre de 2019. \n\n↑ Jodelet, Denise (2011). «Aportes del enfoque de las representaciones sociales al campo de la educación.». Espacios en blanco. Revista de educación, 21, 133-154. Consultado el 11 de noviembre de 2019. \n\n↑ Historia de las ideas lingüísticas. Peter Lang. ISBN 9783631612958. Consultado el 24 de octubre de 2019. \n\n↑ «PEDAGOGIA». \n\n↑ «Etimología de la palabra pedagogía.». \n\n↑ Diccionario de la lengua española\n\n↑ «Diccionario Salamanca de la lengua española». Archivado desde el original el 20 de octubre de 2015. Consultado el 9 de diciembre de 2010. \n\n↑ «Diccionario Salamanca de la Lengua Española: pedagogía». \n\n↑ «Educar, Enseñar, Escolarizar: el problema de la especificación en el devenir de la Pedagogía (y la transmisión)». \n\n↑ «La evaluación de programas educativos: conceptos básicos, planteamientos generales y problemática». \n\n↑ «UN PEDAGOGO/A EN EL ÁMBITO TERAPÉUTICO,¿QUÉ HACE?». \n\n", "subsections": []}, {"name": "Bibliografía", "text": "Abbagnano, N. y Visalberghi, A. Historia de la pedagogía. Novena reimpresión. Madrid: Fondo de Cultura Económica, 1992.\nÁlvarez de Zayas. C. Pedagogía. Un modelo de formación del hombre. 4.ª edición. Cochabamba: Kipus, 2012.\nHevia Berna, Daysi. Hospital Pediátrico Universitario “William Soler”. La Habana, Cuba. Citada en: Biblioteca de Pedagogía. Espasa Siglo XXI.\nKant, Immanuel. Pedagogía\nAbbagnano, N. y Visalberghi, A. Historia de la pedagogía. Novena reimpresión. Madrid: Fondo de Cultura Económica, 1992.\nÁlvarez de Zayas. C. Pedagogía. Un modelo de formación del hombre. 4.ª edición. Cochabamba: Kipus, 2012.\nHevia Berna, Daysi. Hospital Pediátrico Universitario “William Soler”. La Habana, Cuba. Citada en: Biblioteca de Pedagogía. Espasa Siglo XXI.\nKant, Immanuel. Pedagogía\n", "subsections": []}, {"name": "Enlaces externos", "text": " Wikcionario  tiene definiciones y otra información sobre pedagogía.\n Portal:Educación. Contenido relacionado con Educación.\n Wikcionario  tiene definiciones y otra información sobre pedagogía.\n Portal:Educación. Contenido relacionado con Educación.", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Perif%C3%A9rico_(inform%C3%A1tica)", "title": "Periférico (informática)", "summary": "En informática, periférico es la denominación genérica para designar al aparato o dispositivo auxiliar e independiente conectado a la placa base de una computadora.\n\nSe consideran periféricos a las unidades o dispositivos de hardware a través de los cuales el ordenador se comunica con el exterior, y también a los sistemas que almacenan o archivan la información, sirviendo de memoria auxiliar de la memoria principal.[1]​\n\nSe considera periférico a los dispositivos que no pertenecen al núcleo fundamental del ordenador, formado por la unidad central de procesamiento (CPU) y la memoria principal, permitan realizar operaciones de entrada/salida (E/S) complementarias al proceso de datos que realiza la CPU. Estas tres unidades básicas en un ordenador son: CPU, memoria central y el subsistema de E/S, están comunicadas entre sí por tres buses o canales de comunicación:\n\nDirecciones, para seleccionar la dirección del dato o del periférico al que se quiere acceder.\nControl, básicamente para seleccionar la operación a realizar sobre el dato (principalmente lectura, escritura o modificación).\nDatos, por donde circulan los datos.\nDirecciones, para seleccionar la dirección del dato o del periférico al que se quiere acceder.\nControl, básicamente para seleccionar la operación a realizar sobre el dato (principalmente lectura, escritura o modificación).\nDatos, por donde circulan los datos.\n", "sections": [{"name": "Clasificación de periféricos", "text": "A pesar de que el término periférico implica a menudo el concepto de «adicional pero no esencial», muchos de ellos son elementos fundamentales para un sistema informático. El monitor, es prácticamente el único periférico que la personas considera imprescindible en cualquier computadora personal (no lo fue en los primeros computadores) pero a pesar de ello, técnicamente no lo es. El ratón o mouse es posiblemente el ejemplo más claro de este aspecto. A principios de la década de 1990 no todas las computadoras personales incluían este dispositivo. El sistema operativo MS-DOS, el más común en esa época, tenía una interfaz de línea de comandos para lo que no era necesario el empleo de un ratón, todo se hacía mediante comandos de texto. Fue con la popularización de Finder, sistema operativo de la Macintosh de Apple y la posterior aparición de Windows cuando el ratón comenzó a ser un elemento imprescindible en cualquier hogar dotado de una computadora personal. Actualmente existen sistemas operativos con interfaz de texto que pueden prescindir del ratón como, por ejemplo, MS-DOS. El caso del teclado es también emblemático, pues en las nuevas computadoras tabletas, sistemas de juego o teléfonos móviles con pantalla táctil, el teclado se emula en la pantalla. Inclusive en casos de adaptaciones especiales los teclados dejan de ser el periférico de entrada más utilizado, llegando a desaparecer en algunos casos por el uso de programas reconocedores de voz.\n\nLos periféricos pueden clasificarse en las siguientes categorías principales:\n\nPeriféricos de entrada: captan y digitalizan los datos de ser necesario, introducidos por el usuario o por otro dispositivo y los envían al ordenador para ser procesados.\nPeriféricos de salida: son dispositivos que muestran o proyectan información hacia el exterior del ordenador. La mayoría son para informar, alertar, comunicar, proyectar o dar al usuario cierta información, de la misma forma se encargan de convertir los impulsos eléctricos en información legible para el usuario. Sin embargo, no todos de este tipo de periféricos es información para el usuario. Un ejemplo: Impresora.\nPeriféricos de entrada/salida (E/S): sirven para la comunicación de la computadora con el medio externo.\nPeriféricos de almacenamiento: son los dispositivos que almacenan datos e información. La memoria de acceso aleatorio no puede ser considerada un periférico de almacenamiento, ya que su memoria es volátil y temporal. Ejemplos: Disco duro, Memoria flash, Cinta magnética, Memoria portátil, Disquete, Grabadora o lectora de: CD; DVD; Blu-ray; HD-DVD.\nPeriféricos de comunicación: permiten la interacción entre dos o más dispositivos.\nPeriféricos de entrada: captan y digitalizan los datos de ser necesario, introducidos por el usuario o por otro dispositivo y los envían al ordenador para ser procesados.\nPeriféricos de salida: son dispositivos que muestran o proyectan información hacia el exterior del ordenador. La mayoría son para informar, alertar, comunicar, proyectar o dar al usuario cierta información, de la misma forma se encargan de convertir los impulsos eléctricos en información legible para el usuario. Sin embargo, no todos de este tipo de periféricos es información para el usuario. Un ejemplo: Impresora.\nPeriféricos de entrada/salida (E/S): sirven para la comunicación de la computadora con el medio externo.\nPeriféricos de almacenamiento: son los dispositivos que almacenan datos e información. La memoria de acceso aleatorio no puede ser considerada un periférico de almacenamiento, ya que su memoria es volátil y temporal. Ejemplos: Disco duro, Memoria flash, Cinta magnética, Memoria portátil, Disquete, Grabadora o lectora de: CD; DVD; Blu-ray; HD-DVD.\nPeriféricos de comunicación: permiten la interacción entre dos o más dispositivos.\n", "subsections": [{"name": "Periféricos de entrada", "text": "Son los que permiten introducir datos externos a la computadora para su posterior tratamiento por parte de la CPU. Estos datos pueden provenir de distintas fuentes, siendo la principal un ser humano. Los periféricos de entrada más habituales son:\n\nTeclado (keyboard)\nRatón (mouse)\nPanel táctil (touchpad)\nEscáner (scanner)\nEscáner de código de barras\nEscáner de Código QR (quick response code, código de respuesta rápida)\nSensor de huella digital\nCámara web (webcam)\nCámara digital\nMicrófono\nJoystick\nTeclado (keyboard)\nRatón (mouse)\nPanel táctil (touchpad)\nEscáner (scanner)\nEscáner de código de barras\nEscáner de Código QR (quick response code, código de respuesta rápida)\nSensor de huella digital\nCámara web (webcam)\nCámara digital\nMicrófono\nJoystick\nTeclado\nUn teclado de computadora es un periférico, físico o virtual (por ejemplo teclados en pantalla o teclados táctiles), utilizado para la introducción de órdenes y datos en una computadora. Tiene su origen en los teletipos y las máquinas de escribir eléctricas, que se utilizaron como los teclados de los primeros ordenadores y dispositivos de almacenamiento (grabadoras de cinta de papel y tarjetas perforadas). Aunque físicamente hay una miríada de formas, se suelen clasificar principalmente por la distribución del teclado de su zona alfanumérica, pues salvo casos muy especiales es común a todos los dispositivos y fabricantes. Hay varios tipos de teclado.\n\nRatón. Panel táctil\nEl mouse (del inglés, pronunciado [ˈmaʊs]) o ratón es un periférico de entrada de uso manual para computadora, utilizado como entrada o control de datos. Se utiliza con una de las dos manos del usuario y detecta su movimiento relativo en dos dimensiones por la superficie horizontal en la que se apoya, reflejándose habitualmente a través de un puntero o flecha en el monitor. Anteriormente, la información del desplazamiento era transmitida gracias al movimiento de una bola debajo del ratón, la cual accionaba dos rodillos que correspondían a los ejes X e Y. Hoy, el puntero reacciona a los movimientos debido a un rayo de luz que se refleja entre el ratón y la superficie en la que se encuentra.\nCabe aclarar que un ratón óptico apoyado en un espejo o sobre un barnizado por ejemplo es inutilizable, ya que la luz láser no desempeña su función correcta. La superficie a apoyar el ratón debe ser opaca, una superficie que no genere un reflejo, es recomendable el uso de alfombrillas.\n\nEl ratón es el tipo de dispositivo apuntador o señalador más utilizado; existen también: gamepad, lápiz óptico, palanca de mando (joystick), Touchpad, Trackball, volante para videojuegos, etcétera.\n\nMicrófono\nCon el micrófono, además de grabar cualquier audio o sonido mediante alguna aplicación informática, también permite el uso de sistemas de reconocimiento del habla o reconocimiento de voz, disponible incluso en navegadores web para la búsqueda de información, tanto es computadoras portátiles o computadoras de escritorio, como en dispositivos móviles.\n\nEscáner\nEn informática, un escáner (del inglés: scanner) es un periférico que se utiliza para convertir, mediante el uso de la luz, imágenes o cualquier otro impreso a formato digital. Actualmente vienen unificadas con las impresoras formando multifunciones.\n\nCámara digital\nCámara digital\nCámara fotográfica\nVideocámara\nCámara web (webcam)\nCámara digital\nCámara fotográfica\nVideocámara\nCámara web (webcam)\nCámara fotográfica\nVideocámara\nCámara web (webcam)\nCámara fotográfica\nVideocámara\nCámara web (webcam)\n"}, {"name": "Periféricos de salida", "text": "Los periféricos de salida reciben la información procesada por la CPU y la reproducen, de modo que sea perceptible por el usuario.\n\nMonitor de computadora\nImpresora\nLed\nVisualizador\nProyector de vídeo\nMonitor de computadora\nImpresora\nLed\nVisualizador\nProyector de vídeo\nAltavoz\nAuriculares\nTarjeta de sonido\nAltavoz\nAuriculares\nTarjeta de sonido\nImpresora braille\nImpresora 3D\nImpresora braille\nImpresora 3D\nMonitor\nEl \"monitor de computadora\" o \"pantalla de computadora\" es el dispositivo de salida que mediante una interfaz muestra los resultados o los gráficos del procesamiento de una computadora. Existen varios tipos de monitores:\n\nde tubo de rayos catódicos (CRT),\nde pantalla de plasma (PDP),\nde pantalla de cristal líquido (LCD),\nde paneles de diodos orgánicos de emisión de luz (OLED),\nLáser-TV, entre otros.\nImpresora\nUna impresora es un periférico de computadora que permite producir una copia permanente de textos o gráficos de documentos almacenados en formato electrónico, imprimiendo en papel de lustre los datos en medios físicos, normalmente en papel o transparencias, utilizando cartuchos de tinta o tecnología láser. Muchas impresoras son usadas como periféricos, y están permanentemente unidas a la computadora por un cable. Otras impresoras, llamadas impresoras de red, tienen una interfaz de red interna (típicamente wireless o Ethernet), y que puede servir como un dispositivo para imprimir en papel algún documento para cualquier usuario de la red. Actualmente se comercializan impresoras multifuncionales, que aparte de sus funciones de impresora funcionan simultáneamente como fotocopiadora y escáner, siendo este tipo de impresoras las más recurrentes en el mercado. Cabe destacar que las impresoras multifuncionales no pertenecen a los periféricos de salida solamente, sino que se las considera como periféricos de entrada/salida.\n\nImpresora de impacto\nImpresora matricial\nImpresora de margarita\nImpresora de línea\nImpresora de sublimación\nImpresora de inyección\nImpresora térmica\nImpresora láser\nImpresora de impacto\nImpresora matricial\nImpresora de margarita\nImpresora de línea\nImpresora matricial\nImpresora de margarita\nImpresora de línea\nImpresora matricial\nImpresora de margarita\nImpresora de línea\nImpresora de sublimación\nImpresora de inyección\nImpresora térmica\nImpresora láser\nAltavoz o parlante. Auriculares\nLos altavoces se utilizan para escuchar los sonidos emitidos por la computadora, tales como música, sonidos de errores, conferencias, etcétera.\n\nLas placas base suelen llevar un altavoz que emite pitidos para indicar posibles errores o procesos, o para indicar acciones para las personas con discapacidades visuales, como la activación de Bloq Num o ⇪ Bloq Mayús.\nLas placas base suelen llevar un altavoz que emite pitidos para indicar posibles errores o procesos, o para indicar acciones para las personas con discapacidades visuales, como la activación de Bloq Num o ⇪ Bloq Mayús.\n"}, {"name": "Periféricos de entrada/salida", "text": "Los periféricos de entrada/salida son los que utiliza la computadora para mandar y para recibir información. Su función es la de almacenar o guardar, de forma permanente o virtual, todo aquello que hagamos con la computadora para que pueda ser utilizado por los usuarios u otros sistemas.\n\nPantalla táctil o multitáctil\nPantalla táctil\n\nEs una pantalla que mediante un toque directo sobre su superficie permite la entrada de datos y órdenes al dispositivo, y a su vez muestra los resultados introducidos previamente; actuando como periférico de entrada y salida de datos, así como emulador de datos interinos erróneos al no tocarse efectivamente. Este contacto también se puede realizar por medio de un lápiz óptico u otras herramientas similares. Actualmente hay pantallas táctiles que pueden instalarse sobre una pantalla normal, de cualquier tipo o denominación (LCD, monitores y televisores CRT, plasma, etc.).\n\nMultitáctil\n\nEs el nombre con el que se conoce a una técnica de interacción persona-computador y al hardware que la aplica. La tecnología multitáctil consiste en una pantalla táctil o touchpad que reconoce simultáneamente múltiples puntos de contacto, así como el software asociado a esta que permite interpretar dichas interacciones simultáneas.\n\nImpresora multifunción\nUna impresora multifunción o dispositivo multifuncional es un periférico que se conecta a la computadora y que posee las siguientes funciones dentro de un único bloque físico:\nImpresora, escáner, fotocopiadora, ampliando o reduciendo el original,\nfax (opcionalmente). Lector de memoria para la impresión directa de fotografías de cámaras digitales. En ocasiones, aunque el fax no esté incorporado, la impresora multifunción es capaz de controlarlo si se le conecta a un puerto USB. También, pueden poseer un disco duro (las unidades más grandes utilizadas en oficinas) para almacenar documentos e imágenes.\n\nCasco virtual\n"}, {"name": "Periféricos de almacenamiento", "text": "Los dispositivos y soportes de almacenamiento guardan los datos que usa la CPU una vez que han sido eliminados de la memoria principal, porque la memoria se borra cada vez que se apaga la computadora. Pueden ser internos o portátiles, como un disco duro, o extraíbles, como un CD o DVD.[2]​\n\nTarjeta perforada\nCinta perforada\nCinta magnética\nDisco magnético\nDisquete\nDisco duro\nDisco duro fijo o interno\nDisco duro portátil o externo\nDisco óptico (DO)\nDisco compacto (CD o Compact Disc)\nDisco Versátil Digital (DVD)\nDisco Blu-ray (BD o Blu-ray Disc)\nDisco magneto-óptico\nDisco Zip (Iomega): 100 MB, tecnología magnética\nDisquete SuperDisk de 3,5\": 128 MB a 640 MB, tecnología magneto-óptica\nLS-120\nLS-240\nDisco Jaz (Iomega): capacidad de 1 GB a 2 GB\nMemoria Flash\nMemoria USB\nTarjetas de memoria\nUnidad de estado sólido\nTarjeta perforada\nCinta perforada\nCinta magnética\nDisco magnético\nDisquete\nDisco duro\nDisco duro fijo o interno\nDisco duro portátil o externo\nDisquete\nDisco duro\nDisco duro fijo o interno\nDisco duro portátil o externo\nDisquete\nDisco duro\nDisco duro fijo o interno\nDisco duro portátil o externo\nDisco duro fijo o interno\nDisco duro portátil o externo\nDisco duro fijo o interno\nDisco duro portátil o externo\nDisco óptico (DO)\nDisco compacto (CD o Compact Disc)\nDisco Versátil Digital (DVD)\nDisco Blu-ray (BD o Blu-ray Disc)\nDisco compacto (CD o Compact Disc)\nDisco Versátil Digital (DVD)\nDisco Blu-ray (BD o Blu-ray Disc)\nDisco compacto (CD o Compact Disc)\nDisco Versátil Digital (DVD)\nDisco Blu-ray (BD o Blu-ray Disc)\nDisco magneto-óptico\nDisco Zip (Iomega): 100 MB, tecnología magnética\nDisquete SuperDisk de 3,5\": 128 MB a 640 MB, tecnología magneto-óptica\nLS-120\nLS-240\nDisco Jaz (Iomega): capacidad de 1 GB a 2 GB\nDisco Zip (Iomega): 100 MB, tecnología magnética\nDisquete SuperDisk de 3,5\": 128 MB a 640 MB, tecnología magneto-óptica\nLS-120\nLS-240\nDisco Jaz (Iomega): capacidad de 1 GB a 2 GB\nDisco Zip (Iomega): 100 MB, tecnología magnética\nDisquete SuperDisk de 3,5\": 128 MB a 640 MB, tecnología magneto-óptica\nLS-120\nLS-240\nLS-120\nLS-240\nLS-120\nLS-240\nDisco Jaz (Iomega): capacidad de 1 GB a 2 GB\nMemoria Flash\nMemoria USB\nTarjetas de memoria\nUnidad de estado sólido\nMemoria USB\nTarjetas de memoria\nUnidad de estado sólido\nMemoria USB\nTarjetas de memoria\nUnidad de estado sólido\nMemoria secundaria\nLa memoria secundaria (auxiliar, periférica o externa) o almacenamiento secundario, es el conjunto de dispositivos y soportes de almacenamiento de datos que conforman el subsistema de memoria del sistema informático, junto con la memoria primaria o principal.\n\nEl disco duro es un sistema de grabación magnética digital, es donde en la mayoría de los casos reside el sistema operativo de la computadora. En los discos duros se almacenan los datos del usuario. En él encontramos dentro de la carcasa una serie de platos metálicos apilados girando a gran velocidad. Sobre estos platos se sitúan los cabezales encargados de leer o escribir los impulsos magnéticos.\n\nUna unidad de estado sólido es un sistema de memoria no volátil. Están formados por varios chips de memoria NAND Flash en su interior unidos a una controladora que gestiona todos los datos que se transfieren. Tienen una gran tendencia a suceder definitivamente a los discos duros mecánicos por su gran velocidad y tenacidad. Al no estar formadas por discos en ninguna de sus maneras, no se pueden categorizar como tal, aunque erróneamente se tienda a ello.\n\nAlmacenamiento de red\nAlmacenamiento en nube\nServicio de alojamiento de archivos\nDropbox\nGoogle Drive\nOneDrive\nAlmacenamiento de conexión directa (Direct Attached Storage, DAS)\nAlmacenamiento conectado en red (Network Attached Storage, NAS)\nRed de área de almacenamiento (Storage Area Network, SAN)\nAlmacenamiento en nube\nServicio de alojamiento de archivos\nDropbox\nGoogle Drive\nOneDrive\nDropbox\nGoogle Drive\nOneDrive\nDropbox\nGoogle Drive\nOneDrive\nAlmacenamiento de conexión directa (Direct Attached Storage, DAS)\nAlmacenamiento conectado en red (Network Attached Storage, NAS)\nRed de área de almacenamiento (Storage Area Network, SAN)\n"}, {"name": "Periféricos de comunicación", "text": "Su función es permitir o facilitar la interacción entre dos o más computadoras. Entre ellos se encuentran los siguientes:\n\nTarjetas de red\nLas placas o tarjetas de interfaz de red (Network Interface Card, NIC) pueden estar integradas a la placa base o conectadas mediante ranuras de expansión.\n\nMódems\nConcentradores (hubs)\nConmutadores de red (switches)\nEnrutadores (routers)\nComunicación inalámbrica"}]}, {"name": "Referencias", "text": "↑ «Periféricos informáticos». Archivado desde el original el 24 de septiembre de 2016. Consultado el 24 de septiembre de 2016. \n\n↑ Otros dispositivos de almacenamiento, por ejemplo, EZFlyer (SyQuest): 230 MB y tiene una velocidad de lectura muy alta.\n\n", "subsections": []}, {"name": "Véase también", "text": " Portal:Informática. Contenido relacionado con Informática.\nHardware\nDirecciones base de entrada/salida\n Portal:Informática. Contenido relacionado con Informática.\nHardware\nDirecciones base de entrada/salida\n", "subsections": []}, {"name": "Enlaces externos", "text": " Wikimedia Commons alberga una categoría multimedia sobre Periférico.\n[1]\n Wikimedia Commons alberga una categoría multimedia sobre Periférico.\n[1]", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Personaje_jugador_(videojuegos)", "title": "Personaje jugador (videojuegos)", "summary": "En los videojuegos de rol un personaje jugador (término abreviado a veces con las siglas «PJ» y tomado del término utilizado en los juegos de rol tradicionales) es un personaje ficticio controlado por uno de los jugadores en el curso de una sesión del videojuego. El resto de personajes, que el director de juego hace intervenir en cada una de las sesiones de juego, son los personajes no jugadores.\n\nAlgunos juegos de video sólo tienen un personaje del jugador, los demás, especialmente los de dos jugadores tienen dos, o de otro pequeño número de personajes de los jugadores para elegir, uno para cada jugador. Cuando más de un personaje del jugador está disponible, los personajes pueden tener poca o completamente diferentes, fortalezas y debilidades para hacer que el estilo del juego sea diferente. Juegos como el juego de lucha suelen tener una mayor cantidad de personajes de los jugadores para elegir, con algunos movimientos básicos a disposición de todos o casi todos los personajes y algunos movimientos únicos sólo disponibles para uno o algunos personajes. Los juegos de lucha a menudo no tienen única  niveles para viajar a través del combate sólo, así que tener muchos personajes diferentes contra los que jugar, que poseen diferentes movimientos y habilidades es necesario para crear una variedad de juego más grande que otros juegos pueden conseguir con diferentes niveles.\n\n", "sections": [{"name": "Descripción", "text": "", "subsections": [{"name": "Avatares", "text": "El personaje de un jugador a veces puede estar basado en una persona real, especialmente en juegos de deportes en que se utilizan los nombres y semejanzas de los deportistas reales. Personajes históricos y los líderes a veces puede aparecer como personajes también, sobre todo en juegos de estrategia o de construcción de imperios como en la serie de ordenador Civilization de Sid Meier de una serie en ordenador. Poseen características que curiosamente, en el caso de la civilización, que un jugador histórico elegido es el mismo durante todo el transcurso del juego a pesar de que una  campaña puede durar varios cientos de años antes y después del curso de la vida del personaje histórico real. Este personaje del jugador es más propiamente un  Avatar ya que el nombre del personaje del jugador y la imagen suelen tener poco que ver con el juego en sí. Los avatares también se ven comúnmente en las simulaciones de juegos de casino.\n\n"}, {"name": "Los juegos de rol", "text": "En los juegos de rol, tales como Calabozos y Dragones o Skyrim, un jugador por lo general crea o adquiere la identidad de un personaje que puede no tener nada en común con el jugador. El personaje es por lo general de una determinada (a menudo ficticias) raza y clase (como el guerrero o hechicero), cada uno con fortalezas y debilidades. Los atributos de los personajes (por ejemplo, la magia y la capacidad de la lucha) se presentan como valores numéricos que pueden ser mayores a medida que el jugador progresa y gana puntos de rango y experiencia al lograr objetivos o luchar contra enemigos.\n\n"}, {"name": "Juegos de Aventura", "text": "En muchos videojuegos, y especialmente en los juegos de disparos en primera persona, el personaje del jugador es una persona anónima, sin ninguna característica notable o incluso trasfondo. Normalmente, esto es hecho intencionalmente por los creadores del juego para que el jugador pueda simplemente imaginarse a sí mismo en la aventura sin estar obligado a interpretar un personaje que es de una edad diferente, raza, sexo u origen. \"El extranjero\" de la franquicia  Myst es un personaje de este tipo. En la mayoría de estos juegos, el personaje del jugador no tiene diálogo en pantalla y los personajes no jugadores por lo general se ocuparán del jugador, como si ellos no esperaran de él una respuesta verbal. Nunca se llama al personaje del jugador por su nombre y siempre se trata al jugador en una forma neutral al género. Esto también se encuentra frecuentemente en juegos de estrategia en tiempo real como Dune 2000 y Emperador: Battle for Dune. En estos juegos, la única indicación real de que el jugador tiene un personaje (en lugar de un estado omnipresente), es la de las escenas cinemáticas durante las cuales al personaje se le está dando un informe de la misión o de seguimiento, el jugador suele abordarse como \"general\", \"comandante\", u otro grado militar. En la cultura del juego, tal personaje se llamaba Persona aventurera sin edad, sin rostro, neutral en cuanto al género, culturalmente ambiguo, abreviado como AFGNCAAP (que se pronuncia \"Afgan-cap\"), un término que se originó en Zork: Grand Inquisidor donde se utiliza para referirse a satíricamente al jugador. Estos juegos también son conocidos por su falta de espejos en los que un jugador pueda mirar directamente.\n"}]}, {"name": "Personajes no jugadores y secretos", "text": "En contraste, un personaje no jugador (a menudo abreviado como APN) es un personaje en un juego cuyas acciones no están bajo el control del jugador. Personajes no jugables pueden ser simples espectadores, competidores,  patrones, o puedan existir para ayudar al progreso del jugador en el juego.\n\nUn personaje secreto puede ser un personaje jugable en un juego de video disponible después de completar el juego, o cumplir con otros requisitos. En algunos juegos de video, los personajes que no son secretos, pero solo aparecen como personajes no jugadores como patrones o enemigos se convierten en personajes jugables, después de completar ciertos requisitos, o, a veces haciendo trampa.\n\n", "subsections": []}, {"name": "Véase también", "text": "Personaje no jugador\nJuego de rol\nPersonaje no jugador\nJuego de rol", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Plataforma_(inform%C3%A1tica)", "title": "Plataforma (informática)", "summary": "En informática, plataforma (a veces también denominada plataforma digital o plataforma informática o plataforma computacional)[1]​[2]​[3]​ es un sistema que sirve como base para hacer funcionar determinados módulos de hardware o de software con los que es compatible.[4]​ Dicho sistema está definido por un estándar alrededor del cual se determina una arquitectura de hardware y una plataforma de software (incluyendo entornos de aplicaciones).[5]​ Al definir plataformas se establecen los tipos compatibles de arquitectura, sistema operativo, lenguaje de programación o interfaz de usuario.\n\nEjemplos de plataformas son IBM-PC, que incluye las arquitecturas I386 (x86), IA64 o AMD64 (x86-64); Macintosh, que incluye la arquitectura Gecko y PowerPC; y SPARC. Existen programas multiplataforma que permiten ejecutarse en diversas plataformas. También existen emuladores, que son programas que permiten ejecutar desde una plataforma programas de otra emulando su funcionamiento, como por ejemplo UAE, que emula el hardware  VICE, un emulador de los legendarios Commodore 8 bits de mitad de los 80..\n\n", "sections": [{"name": "Plataforma cruzada", "text": "El término plataforma cruzada se refiere a la capacidad de un software o hardware para correr de modo idéntico sobre plataformas diferentes.[6]​ Muchas aplicaciones de Windows y Macintosh, por ejemplo, ahora producen archivos compatibles en lo binario, lo que permite a los usuarios cambiar de una plataforma a otra sin convertir sus datos a un nuevo formato.\n\nLa informática de plataforma cruzada se hace cada vez más importante a medida que las redes de área local se perfeccionan en la integración de las máquinas de diferentes plataformas. Por ejemplo, el ambiente de programación de plataforma cruzada permite a un programador desarrollar programas para muchas plataformas simultáneamente. \n\nEn informática una plataforma es, en pocas palabras (y siendo muy liberales), determinado software y/o hardware con el cual una aplicación es compatible y permite ejecutarla.\n\nUna plataforma es, por ejemplo, un sistema operativo, un gran software que sirve como base para ejecutar determinadas aplicaciones compatibles con este. También son plataformas la arquitectura de hardware, los lenguajes de programación  y sus librerías en tiempo de ejecución, las consolas de videojuegos, etc.\n\nExisten programas multiplataforma, que permiten ejecutarse en diversas plataformas. También existen emulador, programas que permiten ejecutar desde una plataforma programas de otra emulando su funcionamiento.\n\n", "subsections": []}, {"name": "Galería de imágenes", "text": "", "subsections": []}, {"name": "Véase también", "text": "Framework\nAndroid\nTeléfono inteligente\nGalaxy Nexus\nMultiplataforma\nPlataforma Java\nJava (lenguaje de programación)\nFramework\nAndroid\nTeléfono inteligente\nGalaxy Nexus\nMultiplataforma\nPlataforma Java\nJava (lenguaje de programación)\n", "subsections": []}, {"name": "Referencias", "text": "↑ «What is a digital platform? And how does it differ from campaigns or branding?». Cibersitio 'Quora'. \n\n↑ «Everything you need to know about Digital Platforms». Cibersitio 'stephane-castellani.com'. 22 de septiembre de 2016. \n\n↑ «Definition - What does Platform mean?». Cibersitio 'Techopedia'. \n\n↑ «What I Talk About When I Talk About Platforms». Cibersitio 'martinFowler.com'. \n\n↑ «Computing Platforms / Computing platforms created using microprocessors, I/O devices, and memory components / The microprocessor is an important element of the embedded computing system, but it cannot do its job without memories and I/O devices». Cibersitio 'ScienceDirect'. \n\n↑ «CROSS-PLATFORM | meaning in the Cambridge English Dictionary». \n\n", "subsections": []}, {"name": "Enlaces externos", "text": "Program Library HOWTO\nProgram Library HOWTO", "subsections": []}]}
